Masmiseim36/nxpSDK/boards/evkmimxrt1010/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_09 (number 3), LPUART1_RXD/J56[2] */
#define BOARD_INITLPUART_UART1_RXD_PERIPHERAL                            LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITLPUART_UART1_RXD_SIGNAL                                    RXD   /*!< LPUART1 signal: RXD */

/* GPIO_10 (number 2), LPUART1_TXD/J56[4] */
#define BOARD_INITLPUART_UART1_TXD_PERIPHERAL                            LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITLPUART_UART1_TXD_SIGNAL                                    TXD   /*!< LPUART1 signal: TXD */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);

/* GPIO_11 (number 1), GPIO_11 */
#define BOARD_INITLED_GPIO_11_PERIPHERAL                                   GPIO1   /*!< Device name: GPIO1 */
#define BOARD_INITLED_GPIO_11_SIGNAL                                  gpiomux_io   /*!< GPIO1 signal: gpiomux_io */
#define BOARD_INITLED_GPIO_11_CHANNEL                                        11U   /*!< GPIO1 gpiomux_io channel: 11 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLED(void);

/* GPIO_SD_05 (number 70), USER_BUTTON */
#define BOARD_INITBUTTON_USER_BUTTON_GPIO                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITBUTTON_USER_BUTTON_PORT                                  GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITBUTTON_USER_BUTTON_PIN                                      5U   /*!< GPIO2 pin index: 5 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTON(void);

/* GPIO_AD_01 (number 59), ADC12_1/J26[10]/J56[14] */
#define BOARD_INITADC_ADC12_1_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADC_ADC12_1_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITADC_ADC12_1_CHANNEL                                         1U   /*!< ADC1 IN channel: 1 */

/* GPIO_AD_02 (number 58), ADC12_2/J26[12]/J56[16] */
#define BOARD_INITADC_ADC12_2_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADC_ADC12_2_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITADC_ADC12_2_CHANNEL                                         2U   /*!< ADC1 IN channel: 2 */

/* GPIO_AD_07 (number 51), ADC12_3/J26[2] */
#define BOARD_INITADC_ADC12_3_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADC_ADC12_3_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITADC_ADC12_3_CHANNEL                                         7U   /*!< ADC1 IN channel: 7 */

/* GPIO_AD_09 (number 48), ADC12_4/JTAG_TDO/J55[6]/J26[4] */
#define BOARD_INITADC_ADC12_4_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADC_ADC12_4_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITADC_ADC12_4_CHANNEL                                         9U   /*!< ADC1 IN channel: 9 */

/* GPIO_AD_10 (number 47), ADC12_5/JTAG_TDI/J55[8]/J26[6] */
#define BOARD_INITADC_ADC12_5_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADC_ADC12_5_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITADC_ADC12_5_CHANNEL                                        10U   /*!< ADC1 IN channel: 10 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);

/* GPIO_02 (number 11), I2C1_SCL/U10[17]/J57[20]/U26[4] */
#define BOARD_INITPWM_I2C1_SCL_PERIPHERAL                                   PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWM_I2C1_SCL_SIGNAL                                          A   /*!< PWM1 signal: A */
#define BOARD_INITPWM_I2C1_SCL_CHANNEL                                        0U   /*!< PWM1 A channel: 0 */

/* GPIO_01 (number 12), I2C1_SDA/U10[18]/J57[18]/U26[6] */
#define BOARD_INITPWM_I2C1_SDA_PERIPHERAL                                   PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWM_I2C1_SDA_SIGNAL                                          B   /*!< PWM1 signal: B */
#define BOARD_INITPWM_I2C1_SDA_CHANNEL                                        0U   /*!< PWM1 B channel: 0 */

/* GPIO_04 (number 9), SAI1_TXD0/U10[14] */
#define BOARD_INITPWM_SAI1_TXD0_PERIPHERAL                                  PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWM_SAI1_TXD0_SIGNAL                                         A   /*!< PWM1 signal: A */
#define BOARD_INITPWM_SAI1_TXD0_CHANNEL                                       1U   /*!< PWM1 A channel: 1 */

/* GPIO_03 (number 10), SAI1_RXD0/U10[16] */
#define BOARD_INITPWM_SAI1_RXD0_PERIPHERAL                                  PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWM_SAI1_RXD0_SIGNAL                                         B   /*!< PWM1 signal: B */
#define BOARD_INITPWM_SAI1_RXD0_CHANNEL                                       1U   /*!< PWM1 B channel: 1 */

/* GPIO_05 (number 8), SAI1_TXD1 */
#define BOARD_INITPWM_SAI1_TXD1_PERIPHERAL                                  PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWM_SAI1_TXD1_SIGNAL                                         B   /*!< PWM1 signal: B */
#define BOARD_INITPWM_SAI1_TXD1_CHANNEL                                       2U   /*!< PWM1 B channel: 2 */

/* GPIO_06 (number 6), SAI1_TX_BCLK/U10[12] */
#define BOARD_INITPWM_SAI1_TX_BCLK_PERIPHERAL                               PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWM_SAI1_TX_BCLK_SIGNAL                                      A   /*!< PWM1 signal: A */
#define BOARD_INITPWM_SAI1_TX_BCLK_CHANNEL                                    2U   /*!< PWM1 A channel: 2 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
